[
  {
    "project_name": "Scholar 360",
    "project_id": 1,
    "purpose": "Scholar 360 is a Scholarship Management System that streamlines the process of finding, applying for, and managing scholarships. It serves students, administrators, and moderators with an intuitive and secure platform.",
    "live_url": "https://scholar360.netlify.app/",
    "github_repo_link": "https://github.com/RAKIBURRAHMAN007/Scholar-360-client-side",
    "image": "https://i.ibb.co.com/example-image.png",
    "images": [
      "https://i.ibb.co.com/PzJzQb0N/Screenshot-172.png",
      "https://i.ibb.co.com/5Xj2fpt6/Screenshot-180.png",
      "https://i.ibb.co.com/prsTR2GW/Screenshot-181.png",
      "https://i.ibb.co.com/G37hCNVV/Screenshot-182.png",
      "https://i.ibb.co.com/wFG8MvMg/Screenshot-183.png",
      "https://i.ibb.co.com/dsT032Ct/Screenshot-184.png",
      "https://i.ibb.co.com/M52VHQcp/Screenshot-185.png",
      "https://i.ibb.co.com/p6b3Vznq/Screenshot-188.png",
      "https://i.ibb.co.com/zVtFW5MC/Screenshot-190.png"
    ],
    "key_features": [
      "Role-Based Access: Separate dashboards for users, administrators, and moderators.",
      "Comprehensive Scholarship Search: Allows users to explore scholarships by name, university and eligibility.",
      "Application Management System: Users can apply for scholarships and track their application status.",
      "Secure Authentication: Email/password login with Firebase, including social login options.",
      "Dynamic Admin & Moderator Controls: Admins and moderators can manage scholarships, applications, and Admin can manage (users) user roles.",
      "Integrated Payment Gateway: Stripe integration for secure application fee payments.",
      "User Dashboard: View applied scholarships, manage applied  applications, and track application status.",
      "Review and Rating System: Users can review scholarships with ratings and comments.",
      "Responsive Design: Fully optimized for mobile, tablet, and desktop users.",
      "Error Handling: Custom 404 page and user-friendly error messages.",
      "Real-Time Notifications: Updates on application progress and status changes.",
      "Environment Security: Secures Firebase and MongoDB credentials using environment variables."
    ],
    "npm_packages": [
      "React",
      "React Router DOM",
      "Firebase",
      "Tailwind CSS",
      "React Toastify",
      "SweetAlert2",
      "MongoDB",
      "Express",
      "Cors",
      "dotenv",
      "Moment.js",
      "React Hook Form",
      "JWT",
      "Stripe"
    ]
  },
  {
    "project_name": "RestoRooms",
    "project_id": 2,
    "purpose": "A modern Hotel Booking Platform that provides users with a seamless and engaging experience for discovering and booking hotel rooms. It combines interactive design, robust functionality, and secure user authentication to ensure an enjoyable and trustworthy platform for users.",
    "live_url": "https://restorooms.netlify.app/",
    "github_repo_link": "https://github.com/RAKIBURRAHMAN007/RestoRooms",
    "image": "https://i.ibb.co.com/TYVKkJ8/Screenshot-77.png",
    "images": [
      "https://i.ibb.co.com/PCcMBNh/Screenshot-94.png",
      "https://i.ibb.co.com/W5btzr1/Screenshot-93.png",
      "https://i.ibb.co.com/vVxMjP4/Screenshot-92.png",
      "https://i.ibb.co.com/ryB9bY6/Screenshot-91.png",
      "https://i.ibb.co.com/vH8bPGJ/Screenshot-90.png",
      "https://i.ibb.co.com/tCRswn8/Screenshot-95.png",
      "https://i.ibb.co.com/Qjzbtnx/Screenshot-89.png",
      "https://i.ibb.co.com/ck51Hn6/Screenshot-88.png"
    ],
    "key_features": [
      "Homepage Design: Includes a banner, a map, and featured rooms with a 'Book Now' button.",
      "User Authentication: Email and password-based authentication, including social login options.",
      "Rooms Page: Displays all rooms with images, descriptions, and booking options.",
      "Room Details Page: Displays detailed information about rooms, with booking and review options.",
      "My Bookings Page: Shows the rooms booked by the logged-in user, with options to cancel and update booking dates.",
      "Review System: Allows users to post reviews for rooms they've booked.",
      "Access Control: Only authenticated users can book rooms and post reviews.",
      "404 Page: Custom 404 page for invalid routes.",
      "Secure Data Management: Secure credentials using environment variables for Firebase and MongoDB."
    ],
    "npm_packages": [
      "React",
      "React Router DOM",
      "Firebase",
      "Tailwind CSS",
      "React Toastify",
      "SweetAlert2",
      "MongoDB",
      "React Simple Typewriter",
      "React Tooltip",
      "dotenv",
      "Cors",
      "Express",
      "React countup",
      "momentjs",
      "JWT"
    ]
  },
  {
    "project_name": "Visa Nexus",
    "project_id": 3,
    "purpose": "The Visa Navigator Portal aims to simplify and enhance the process of managing visa related activities by providing a user-friendly platform. It allows users to explore various visa options, check detailed requirements, apply for visas, and track their applications seamlessly.",
    "live_url": "https://visa-nexus.netlify.app/",
    "github_repo_link": "https://github.com/RAKIBURRAHMAN007/Visa_Nexus-ClientSide",
    "image": "https://i.ibb.co.com/TYVKkJ8/Screenshot-77.png",
    "images": [
      "https://i.ibb.co.com/TYVKkJ8/Screenshot-77.png",
      "https://i.ibb.co.com/JQcyWDf/Screenshot-85.png",
      "https://i.ibb.co.com/VHhJ3WM/Screenshot-84.png",
      "https://i.ibb.co.com/FBMcKZJ/Screenshot-82.png",
      "https://i.ibb.co.com/WzPh5xH/Screenshot-80.png",
      "https://i.ibb.co.com/RBpV7z0/Screenshot-78.png"
    ],
    "key_features": [
      "Simplified Visa Management: Easily browse visa options, check requirements, and track applications.",
      "Firebase Authentication: Secure login/register with Google sign-in and private user routes.",
      "Visa Application Tracking: Users can view and manage their visa applications with real-time updates.",
      "Add and Manage Visas: Private route to add, update, and delete visas, with secure database integration.",
      "Responsive Design: Fully optimized for mobile, tablet, and desktop devices.",
      "Filter and Search Options: Advanced filtering by visa type and search functionality for easy navigation.",
      "User-Friendly Alerts: Toast and sweet alert notifications for all actions and error handling.",
      "Error Handling: Custom 404 page for invalid routes.",
      "Secure Data Management: Environment variables for Firebase keys and secure user access.",
      "Light/Dark Mode Toggle: Theme customization for better user experience."
    ],
    "npm_packages": [
      "React",
      "React Router DOM",
      "Firebase",
      "Tailwind CSS",
      "React Toastify",
      "SweetAlert2",
      "MongoDB",
      "React Simple Typewriter",
      "React Tooltip",
      "dotenv",
      "Cors",
      "Express",
      "React countup"
    ]
  },
  {
    "project_name": "Lingo Bingo",
    "project_id": 4,
    "purpose": "Lingo Bingo is a vocabulary learning application designed to make language acquisition fun, interactive, and accessible. The purpose of the website is to help users overcome the challenges of memorizing and retaining vocabulary in a new language through an engaging and structured approach.",
    "live_url": "https://lingo-bingoo.netlify.app/",
    "github_repo_link": "https://github.com/RAKIBURRAHMAN007/Lingo-Bingo",
    "image": "https://i.ibb.co.com/1bKH1Lc/Screenshot-74.png",
    "images": [
      "https://i.ibb.co.com/1bKH1Lc/Screenshot-74.png",
      "https://i.ibb.co.com/kqtsWjM/Screenshot-76.png",
      "https://i.ibb.co.com/GPH8YGB/Screenshot-75.png",
      "https://i.ibb.co.com/ZW6GnxB/Screenshot-71.png",
      "https://i.ibb.co.com/MsnPM4W/Screenshot-70.png"
    ],
    "key_features": [
      "Interactive Vocabulary Learning: Structured lessons with pronunciation, meaning, and usage examples.",
      "Firebase Authentication: Secure login/register with Google sign-in and private user routes.",
      "User Profiles: View and update profile details like name and photo.",
      "Gamified Progress: Animated counters for vocabulary and lessons completed.",
      "Tutorials: Embedded YouTube videos for pronunciation and cultural learning.",
      "Responsive Design: Optimized for mobile, tablet, and desktop devices.",
      "Pronunciation Support: Audio feature to pronounce vocabulary words.",
      "Error Handling: Custom 404 page for invalid routes.",
      "Secure Data Management: Environment variables for Firebase keys and secure user access."
    ],
    "npm_packages": [
      "react",
      "react-router-dom",
      "firebase",
      "react-toastify",
      "react-countup",
      "axios",
      "animate.css"
    ]
  }
]